In [29]:
#question: can we create csv file using python?
import csv # for csv files

header =['Name','age','city']

rows=[
    ['Amit',32,'Ambala'],
    ['Dev',31,'Patna'],
    ['Sonal',28,'Dehradun']
    ]
print(header)

['Name', 'age', 'city']

In [30]:
<div style ="background-color: #002147; padding: 20px; text-align: center; color: white; font-size:32px font-family:'Arial'">Data Acquisition: Understanding Data Sources, using SQL
</div>

SyntaxError: invalid syntax (3134659939.py, line 1)

In [ ]:
student=["Anjali","Shivani","Samridhi","Aviraj"]

In [ ]:
print(student)

['Anjali', 'Shivani', 'Samridhi', 'Aviraj']

In [ ]:
for n in student:
    print(n)

Anjali
Shivani
Samridhi
Aviraj

In [ ]:
student

['Anjali', 'Shivani', 'Samridhi', 'Aviraj']

In [ ]:
student[2]="Samridhi Tanwar"

In [ ]:
student

['Anjali', 'Shivani', 'Samridhi Tanwar', 'Aviraj']

In [ ]:
student1=("Anjali","Shivani","Samridhi","Aviraj")

In [ ]:
student1[2]="Samridhi"

TypeError: 'tuple' object does not support item assignment

In [ ]:
student2 = {"Roll_no":1, "Name":"Anjali"}

In [ ]:
import json
data=[{"Name":"Anjali","age":30,"city":"hardoi"},{"Name":"Shivani","age":30,"city":"Delhi"},{"Name":"Samridhi Tanwar","age":9,"city":"shahbad"},{"Name":"Aviraj","age":5,"city":"Chandigarh"}]

In [ ]:
with open('student.json',mode='w') as file :
    json.dump(data, file ,indent=4)

In [ ]:
import sqlite3 as sql #working with sqlite calling library
connection=sql.connect('demo.db') #creating database
cursor=connection.cursor()

In [ ]:

cursor.execute('''create table student(
    id integer PRIMARY KEY ,
    name text not null,
    age integer
               );''')

In [ ]:
connection.commit()

In [ ]:
cursor.execute('insert into student (id ,name,age) values (1,"Anjali",30)')
#cursor.execute("")

In [ ]:
cursor.execute("select * from student")

In [ ]:
results = cursor.fetchall()
for row in results :
    print(row)

(1, 'Anjali', 30)

In [ ]:
import pandas as pd
df=pd.DataFrame(results)
df

   0       1   2
0  1  Anjali  30

In [ ]:
cursor.execute('insert into student (id ,name,age) values (2,"Aviraj",5)')

In [ ]:
cursor.execute('insert into student (id ,name,age) values (3,"Samridhi Tanwar",9)')

In [ ]:
cursor.execute('insert into student (id ,name,age) values (4,"Shivani",30)')

In [ ]:
cursor.execute("select * from student")

In [ ]:
results = cursor.fetchall()
for row in results :
    print(row)

(1, 'Anjali', 30)
(2, 'Aviraj', 5)
(3, 'Samridhi Tanwar', 9)
(4, 'Shivani', 30)

In [ ]:
import pandas as pd
df=pd.DataFrame(results)
df

   0                1   2
0  1           Anjali  30
1  2           Aviraj   5
2  3  Samridhi Tanwar   9
3  4          Shivani  30

In [ ]:
import pandas as pd #

In [ ]:
# Synthetic Data Creation

In [ ]:
import pandas as pd #

In [ ]:
# create a simple ,clean synthetic Dataset
data = {
    "student_ID":[101,102,103,104],
    "Name":["Anjali", "Shivani", "Samridhi Tanwar", "Aviraj"],
    "Age":[20,21,23,24],
    "Marks":[89,90,91,92],
    "Department":["AIML","AIML","AIML","AIML"]
}

In [ ]:
df = pd.DataFrame(data)
df

   student_ID             Name  Age  Marks Department
0         101           Anjali   20     89       AIML
1         102          Shivani   21     90       AIML
2         103  Samridhi Tanwar   23     91       AIML
3         104           Aviraj   24     92       AIML

In [ ]:
 #create a simple ,clean synthetic Dataset
data = {
    "student_ID":[101,None,103,104],
    "Name":["Anjali", None, "Samridhi Tanwar", "Aviraj"],
    "Age":[20,21,None,"24"],
    "Marks":[89,91,None,1009],
    "Department":["AIML","AIML",None,42]
}

In [ ]:
df = pd.DataFrame(data)
df

   student_ID             Name   Age   Marks Department
0       101.0           Anjali    20    89.0       AIML
1         NaN             None    21    91.0       AIML
2       103.0  Samridhi Tanwar  None     NaN       None
3       104.0           Aviraj    24  1009.0         42

In [ ]:
import pandas as pd #
import numpy as np

In [39]:
import numpy as np
np.random.seed(0)
n= 10
print(np.random.randint(1,100,10))

[45 48 65 68 68 10 84 22 37 88]

In [40]:
np.random.seed(41)
n= 1000
df = pd.DataFrame({
    "student_ID":[101,102,103,104],
    "Name":["Anjali", "Shivani", "Samridhi Tanwar", "Aviraj"],
    "Age":[20,21,23,24],
    "Marks":[89,90,91,92],
    "Department":["AIML","AIML","AIML","AIML"]
})
df = pd.DataFrame(data)
df

   student_ID             Name   Age   Marks Department
0       101.0           Anjali    20    89.0       AIML
1         NaN             None    21    91.0       AIML
2       103.0  Samridhi Tanwar  None     NaN       None
3       104.0           Aviraj    24  1009.0         42

In [52]:
# Create a Simple, Clean Synthetic Dataset
np.random.seed(42)
n=1000

df=pd.DataFrame({
    "Student_ID": np.arange(101,101+n),
    "Age": np.random.randint(18,25,size=n),
    "Marks": np.random.randint(50,100,size=n),
    "Department": np.random.choice(["AIML", "CSE", "ECE", "MECH","AUTOMATION"],size=n)
})

In [53]:
df.head()

   Student_ID  Age  Marks  Department
0         101   24     91  AUTOMATION
1         102   21     66        AIML
2         103   22     54  AUTOMATION
3         104   24     78  AUTOMATION
4         105   20     53         ECE

In [57]:
for col in["Age","Marks","Department"]:
    df.loc[df.sample(frac=0.05).index, col]=np.nan

In [61]:
## Duplicate records/rows
pd.concat([df,df.sample(20)], ignore_index = True)
# introduce invaid ages
df.loc[df.sample(10).index, "Age"] = np.random.choice([-5, 240], size=10)

In [62]:
# Introduce outliers
df.loc[df.sample(10).index,"Marks"]=np.random.choice([150, 240], size=10)

In [64]:
# Inconsistent Text Formatting
df["Department"] = df["Department"].astype(str)
df.loc[df.sample(frac=0.1).index, "Department"] = df ["Department"].str.lower()

In [65]:
df.head()

   Student_ID   Age  Marks  Department
0         101  24.0   91.0  AUTOMATION
1         102  21.0   66.0        AIML
2         103  22.0   54.0  AUTOMATION
3         104  24.0   78.0  AUTOMATION
4         105  20.0   53.0         ECE

In [67]:
df.tail()

     Student_ID   Age  Marks  Department
995        1096  23.0   83.0         nan
996        1097   NaN   78.0         CSE
997        1098  24.0   53.0        AIML
998        1099  21.0    NaN  AUTOMATION
999        1100  23.0    NaN        MECH

In [68]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Student_ID  1000 non-null   int64
 1   Age         902 non-null    float64
 2   Marks       904 non-null    float64
 3   Department  1000 non-null   object
dtypes: float64(2), int64(1), object(1)
memory usage: 31.4+ KB

In [69]:
df.isnull().sum()

Student_ID     0
Age           98
Marks         96
Department     0
dtype: int64

In [70]:
df.shape
(1000,4)
df.columns
df.sample(10)

     Student_ID   Age  Marks  Department
424         525  -5.0   69.0        MECH
143         244  19.0   55.0         cse
947        1048  19.0   56.0  AUTOMATION
615         716   NaN   84.0        MECH
793         894  23.0    NaN        AIML
927        1028   NaN    NaN        AIML
889         990  19.0   94.0         CSE
271         372  21.0   82.0         CSE
428         529  24.0    NaN  AUTOMATION
280         381  24.0   52.0         CSE

In [71]:
df.isnull().mean()*100

Student_ID    0.0
Age           9.8
Marks         9.6
Department    0.0
dtype: float64

In [72]:
df.isnull().any(axis=1)

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996     True
997    False
998     True
999     True
Length: 1000, dtype: bool

In [73]:
df[df.isnull().any(axis=1)].count()

Student_ID    184
Age            86
Marks          88
Department    184
dtype: int64

In [75]:
df.duplicated(subset=["student_ID"]).sum()

KeyError: Index(['student_ID'], dtype='object')

In [76]:
df.describe()

        Student_ID         Age       Marks
count  1000.000000  902.000000  904.000000
mean    600.500000   23.368071   75.779867
std     288.819436   24.302793   18.466131
min     101.000000   -5.000000   50.000000
25%     350.750000   19.000000   62.000000
50%     600.500000   21.000000   75.000000
75%     850.250000   23.000000   87.250000
max    1100.000000  240.000000  240.000000